app/views/blog_posts/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
					<h3 class="byline">
				  <%= image_tag @blog_post.user.avatar.url(:thumb) if @blog_post.user.avatar.exists? %><%= @blog_post.user.username %>

SELECT "comments".* FROM "comments"  WHERE "comments"."blog_post_id" = ?  [["blog_post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_post_id" = ?  [["blog_post_id", 8]]
---
		<div class="col-md-12">
			<% if @blog_post.comments.count > 0 %>