app/controllers/blog_posts_controller.rb

  def index
    @blog_posts = BlogPost.order(created_at: :desc)
    @latlongarray = BlogPost.all.collect {|blog_post| [blog_post.address, blog_post.latitude, blog_post.longitude, blog_post.blog_entry[0..50], blog_post.photo.url(:small), blog_post.friendly_id, blog_post.title]}
---
SELECT "blog_posts".* FROM "blog_posts"  ORDER BY "blog_posts"."created_at" DESC
SELECT "blog_posts".* FROM "blog_posts"

  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "blog_entry", "user_id", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test"], ["blog_entry", "asdfasdfasdf"], ["user_id", 1], ["address", ""], ["created_at", "2015-03-02 02:10:38.809730"], ["updated_at", "2015-03-02 02:10:38.809730"]]

  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)
---
UPDATE "blog_posts" SET "photo_updated_at" = ?, "photo_file_name" = ?, "longitude" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["photo_updated_at", "2015-03-05 21:00:34.099485"], ["photo_file_name", "urban-night1.jpg"], ["longitude", -84.3718885], ["updated_at", "2015-03-05 21:00:35.456671"], ["id", 1]]

  def destroy
    @blog_post.destroy
---
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 5]]

    def set_blog_post
      @blog_post = BlogPost.friendly.find(params[:id])
---
SELECT  "blog_posts".* FROM "blog_posts"  WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 2]]