app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "blog_post_id", "comment_entry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Aaron"], ["blog_post_id", 1], ["comment_entry", "This blog post is stupid."], ["created_at", "2015-02-20 17:51:47.052844"], ["updated_at", "2015-02-20 17:51:47.052844"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save